import * as Yup from 'yup'

export const registerValidation = Yup.object().shape({
    firstName: Yup.string()
        .required("نام الزامی می باشد")
        .min(4, "نام نباید کمتر از 4 کاراکتر باشد")
        .max(255, "نام نباید بیشتر از 255 کاراکتر باشد"),
    lastName: Yup.string()
        .required("نام خانوادگی الزامی می باشد")
        .min(4, "نام خانوادگی نباید کمتر از 4 کاراکتر باشد")
        .max(255, "نام خانوادگی نباید بیشتر از 255 کاراکتر باشد"),
    username: Yup.string()
        .required("کلمه کاربری الزامی می باشد")
        .min(4, "کلمه کاربری نباید کمتر از 4 کاراکتر باشد")
        .max(255, "کلمه کاربری نباید بیشتر از 255 کاراکتر باشد"),
    address: Yup.string()
        .required("نام خانوادگی الزامی می باشد")
        .min(4, "نام خانوادگی نباید کمتر از 4 کاراکتر باشد")
        .max(255, "نام خانوادگی نباید بیشتر از 255 کاراکتر باشد"),
    email: Yup.string()
        .email("ایمیل معتبر نمی باشد")
        .required("ایمیل الزامی می باشد"),
    mobile: Yup.string().matches(/^(\+98?)?{?(0?9[0-9]{9,9}}?)$/, 'شماره موبایل معتبر نیست').required('موبایل الزامی می باشد.').length(11, 'طول شماره تلفن باید 11 کاراکتر باشد.'),
    password: Yup.string()
        .min(4, "گذرواژه نباید کمتر از 4 کاراکتر باشد")
        .max(255, "گذرواژه نباید بیشتر از 255 کاراکتر باشد")
        .required("گذرواژه الزامی می باشد")
})
export const loginValidation = Yup.object().shape({
    email: Yup.string()
        .email("ایمیل معتبر نمی باشد")
        .required("ایمیل الزامی می باشد"),
    password: Yup.string()
        .min(4, "کلمه عبور نباید کمتر از 4 کاراکتر باشد")
        .max(255, "کلمه عبور نباید بیشتر از 255 کاراکتر باشد")
        .required("کلمه عبور الزامی می باشد")
})